Revit 2026 API

# StringParameterValue Properties

---

The StringParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ParameterValue) |
|  | Value | The stored value |

#### Reference

StringParameterValue Class

Autodesk.Revit.DB Namespace